Tekla.Structures.Model.SharedModelStateEnum
Specifies the state of a shared model in the Tekla Structures sharing service.

Tekla.Structures.Model.SharedModelStateEnum.OFFLINE
Service is not connected, no information about what user can do is available.

Tekla.Structures.Model.SharedModelStateEnum.UNLOCKED
Service is unlocked and current model is shared. User can read in or write out depending on it the model is up-to-date.

Tekla.Structures.Model.SharedModelStateEnum.WRITELOCK
Service is reserved for writing to another user. Current user can read in but not write out.

Tekla.Structures.Model.SharedModelStateEnum.FULLLOCK
Service is reserved for investigation to another user. Current user cannot read in or write out.

Tekla.Structures.Model.SharedModelStateEnum.NEEDJOIN
Service has current packet removed. Current local model cannot be used for sharing, model need to be joined again.